'''
Задание № 6:
Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.

Пример готовой структуры:
[   (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
    (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
    (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”}) ]

Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара,
например название, а значение — список значений-характеристик, например список названий товаров.
Пример:
{   “название”: [“компьютер”, “принтер”, “сканер”],
    “цена”: [20000, 6000, 2000],
    “количество”: [5, 2, 7],
    “ед”: [“шт.”] }
'''

# Часть решения была подсмотрена в Git

print("Задание № 6 (сложное): \n")

# Метод для добавления товаров и данных по ним
inventory_tuple_list = []
i = 1
while True:
    inventory_tuple_list.append(
        (input('Введите номер товара: '), dict({
            'Название': str(input('Введите название: ')),
            'Цена': float(input('Укажите цену: ')),
            'Количество': int(input('Введите количество товара: ')),
            'Ед': str(input('Выберите единицы измерения (например, шт): ')),
        }))
    )

    if input('\nТовар добавлен. Добавить еще один товар? (да/нет): ') == 'нет':
        break

    i += 1

# Вывод списка товаров:
print(f'\nСписок товаров:{inventory_tuple_list}')

output_dict = dict({})
for product in inventory_tuple_list:
    for key, value in product[-1].items():
        if key in output_dict:
            if value not in output_dict.get(key):
                output_dict.get(key).append(value)
        else:
            output_dict.update({key: [value]})

# Вывод аналитики по товарам:
print(f'Аналитика: {output_dict}')